daily_works/2019-07/17___queryStock.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://com/enhancesys/integration/services/interfaces/IntegrationManagement">
   <soapenv:Header/>
   <soapenv:Body>
      <int:invokePrimarySalesInterface>
         <!--Optional:-->
         <moduleId>224</moduleId>
         <!--Optional:-->
         <jsonRequestData>
         <![CDATA[
			{
                "payload": {
			"products": [
					{
					"matrl_code": "P64453",
			           "plant": "P001"
					},
					{
					"matrl_code": "P453",
					"plant": "P002"
					}
				]
			}}
		]]>
         
         </jsonRequestData>
      </int:invokePrimarySalesInterface>
   </soapenv:Body>
</soapenv:Envelope>





---------------------------
{"enabled":true,"res_type":"Success"}
 ---------------------------

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mob="http://mobii.com/">
	<soapenv:Header/>
	<soapenv:Body>
		<mob:MT_QueryStock_Response>
			<Item>
				<MaterialCode>P64453</MaterialCode>
				<Plant>P001</Plant>
				<Stock>100</Stock>
				<Remarks>Success</Remarks>
			</Item>
			<Item>
				<MaterialCode>P453</MaterialCode>
				<Plant>P002</Plant>
				<Stock>100</Stock>
				<Remarks>Success</Remarks>
			</Item>
		</mob:MT_QueryStock_Response>
	</soapenv:Body>
</soapenv:Envelope>




{
	"soapenv:Envelope": {
		"soapenv:Body": {
			"mob:MT_QueryStock_Response": {
				"Item": [
					{
						"Plant": "P001",
						"MaterialCode": "P64453",
						"Remarks": "Success",
						"Stock": "100"
					},
					{
						"Plant": "P002",
						"MaterialCode": "P453",
						"Remarks": "Success",
						"Stock": "100"
					}
				]
			}
		}
	}
}

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:invokePrimarySalesInterfaceResponse xmlns:ns2="http://com/enhancesys/integration/services/interfaces/IntegrationManagement" xmlns:ns3="http://com/enhancesys/entities/schema/integration">
         <invokePrimarySalesInterface>
		 {
			"transaction_id": 227831
		 }
		 </invokePrimarySalesInterface>
      </ns2:invokePrimarySalesInterfaceResponse>
   </soap:Body>
</soap:Envelope>




<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:invokePrimarySalesInterfaceResponse xmlns:ns2="http://com/enhancesys/integration/services/interfaces/IntegrationManagement" xmlns:ns3="http://com/enhancesys/entities/schema/integration">
         <invokePrimarySalesInterface>
		 
	{
	"err_msg": "Plant is Mandatory, but plant value is coming as empty.. value :: ",
	"err_code": "10004",
	"status": "FAIL",
	"transaction_id": 227832
	}    
	</ns2:invokePrimarySalesInterfaceResponse>
   </soap:Body>
</soap:Envelope>


---------------------------
{"enabled":true,"res_type":"Failure"}
 ---------------------------


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mob="http://mobii.com/">
	<soapenv:Header/>
	<soapenv:Body>
		<mob:MT_QueryStock_Request>
			<Item>
				<MaterialCode>P64453</MaterialCode>
				<Plant>P001</Plant>
			</Item>
			<Item>
				<MaterialCode>P453</MaterialCode>
				<Plant>P002</Plant>
			</Item>
		</mob:MT_QueryStock_Request>
	</soapenv:Body>
</soapenv:Envelope>


 <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mob="http://mobii.com/">
	<soapenv:Header/>
	<soapenv:Body>
		<mob:MT_QueryStock_Response/>
	</soapenv:Body>
</soapenv:Envelope>


{
	"soapenv:Envelope": {
		"soapenv:Body": {}
	}
}


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:invokePrimarySalesInterfaceResponse xmlns:ns2="http://com/enhancesys/integration/services/interfaces/IntegrationManagement" xmlns:ns3="http://com/enhancesys/entities/schema/integration">
         <invokePrimarySalesInterface>{"transaction_id":227834}</invokePrimarySalesInterface>
      </ns2:invokePrimarySalesInterfaceResponse>
   </soap:Body>
</soap:Envelope>


-----------------------
{"enabled":false,"res_type":"Success"}
-----------------------


 <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mob="http://mobii.com/">
	<soapenv:Header/>
	<soapenv:Body>
		<mob:MT_QueryStock_Request>
			<Item>
				<MaterialCode>P64453</MaterialCode>
				<Plant>P001</Plant>
			</Item>
			<Item>
				<MaterialCode>P453</MaterialCode>
				<Plant>P002</Plant>
			</Item>
		</mob:MT_QueryStock_Request>
	</soapenv:Body>
</soapenv:Envelope>







<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <soap:Fault>
         <faultcode>soap:Server</faultcode>
         <faultstring>Transaction was rolled back, presumably because setRollbackOnly was called during a synchronization while invoking public abstract java.lang.String com.enhancesys.integration.services.interfaces.IntegrationManagement.invokePrimarySalesInterface(java.lang.Long,java.lang.String) throws net.treetechnologies.common.exception.ApplicationException with params [224, 
         
			{
                "payload": {
			"products": [
					{
					"matrl_code": "P64453",
			           "plant": "P001"
					},
					{
					"matrl_code": "P453",
					"plant": "P002"
					}
				]
			}}
		
         
         ].</faultstring>
      </soap:Fault>
   </soap:Body>
</soap:Envelope>







<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:invokePrimarySalesInterfaceResponse xmlns:ns2="http://com/enhancesys/integration/services/interfaces/IntegrationManagement" xmlns:ns3="http://com/enhancesys/entities/schema/integration">
         <invokePrimarySalesInterface>
		
		{
	"status": "SUCCESS",
	"item": [
		{
			"Plant": "P001",
			"MaterialCode": "P64453",
			"Remarks": "Success",
			"Stock": "100"
		},
		{
			"Plant": "P002",
			"MaterialCode": "P453",
			"Remarks": "Success",
			"Stock": "100"
		}
	],
	"trans_dt": "2019-07-17T19:13:08.429",
	"transaction_id": 227842
}

		 </invokePrimarySalesInterface>
      </ns2:invokePrimarySalesInterfaceResponse>
   </soap:Body>
</soap:Envelope>

{
	"err_msg": "JSONObject[\"mob:MT_QueryStock_Response\"] not found.",
	"err_code": 101,
	"status": "FAIL",
	"transaction_id": 227843
}






























